insert into facts (description, weight) values
    ('Автоматизация тестирования', 1),
    ('Имитационное моделирование сетей связи', 1),
    ('ООП', 1),
    ('Программное обеспечение центров обработки данных', 1);

insert into jobs (name) values
    ('Тестировщик'),
    ('Программист'),
    ('Инженер сетей связи');

insert into trust (job_id, fact_id, trust_cf) values
    (1, 1, 1),
    (1, 2, 0.25),
    (1, 3, 0.75),
    (1, 4, 0.70),
    (2, 1, 0.60),
    (2, 2, 0.05),
    (2, 3, 0.97),
    (2, 4, 0.65),
    (3, 1, 0.20),
    (3, 2, 1),
    (3, 3, 0.10),
    (3, 4, 0.05);
